import random
from time import sleep as sl

potions = 3
potion_drop_chanse = [0, 0, 1, 1, 1, 2, 2, 3]
a1 = [["▲", "▲", "▲", "▲", "▲", "▲", "▲", "▲", "▲", "▲"],
      ["▲", "▲", "▲", "▲", "*", "*", "*", "*", "▲", "▲"],
      ["▲", "▲", "▲", "*", "*", "*", "*", "*", "*", "▲"],
      ["▲", "▲", "*", "*", "*", "*", "*", "*", "*", "▲"],
      ["▲", "▲", "*", "*", "*", "*", "*", "*", "*", "*"],
      ["▲", "▲", "▲", "*", "*", "*", "*", "*", "*", "*"],
      ["▲", "▲", "▲", "*", "*", "*", "*", "*", "*", "*"],
      ["▲", "▲", "*", "*", "*", "*", "*", "*", "*", "*"],
      ["▲", "▲", "*", "*", "*", "*", "*", "*", "*", "*"],
      ["▲", "▲", "*", "*", "*", "*", "*", "*", "*", "*"]]
a2 = [["▲", "▲", "▲", "▲", "▲", "▲", "▲", "▲", "▲", "▲"],
      ["▲", "▲", "▲", "▲", "▲", "▲", "▲", "▲", "▲", "▲"],
      ['▲', '▲', '▲', '*', '*', '*', '*', '*', '*', '▲'],
      ['▲', '▲', '*', '*', '*', '*', '*', '*', '*', '*'],
      ['*', '*', '*', '*', '*', '*', '*', '*', '*', '*'],
      ['*', '*', '*', '*', '*', '*', '*', '*', '*', '*'],
      ['*', '*', '*', '*', '*', '*', '*', '*', '*', '*'],
      ['*', '*', '*', '*', '*', '*', '*', '*', '*', '*'],
      ['*', '*', '*', '*', '*', '*', '*', '*', '*', '*'],
      ['*', '*', '*', '*', '*', '*', '*', '*', '*', '*']]
a3 = [["▲", "▲", "▲", "▲", "▲", "▲", "▲", "▲", "▲", "▲"],
      ["*", "*", "*", "*", "*", '▲', '▲', '▲', '▲', '▲'],
      ["*", "*", "*", "*", "*", '▲', '▲', '▲', '▲', '▲'],
      ["*", "*", "*", "*", "*", '*', '▲', '▲', '▲', '▲'],
      ["*", "*", "*", "*", "*", '*', '▲', '▲', '▲', '▲'],
      ["*", "*", "*", "*", "*", '*', '*', '▲', '▲', '▲'],
      ["*", "*", "*", "*", "*", '*', '*', '*', '▲', '▲'],
      ["*", "*", "*", "*", "*", '*', '*', '*', '▲', '▲'],
      ["*", "*", "*", "*", "*", '*', '*', '*', '▲', '▲'],
      ["*", "*", "*", "*", "*", '*', '*', '▲', '▲', '▲']]
b1 = [['▲', '▲', "*", "*", "*", "*", "*", "*", "*", "*"],
      ['▲', '▲', "*", "*", "*", "*", "*", "*", "*", "*"],
      ['▲', '▲', "*", "*", "*", "*", "*", "*", "*", "*"],
      ['▲', "*", "*", "*", "*", "*", "*", "*", "*", "*"],
      ['▲', "*", "*", "*", "*", "*", "*", "*", "*", "*"],
      ['▲', "*", "*", "*", "*", "*", "*", "*", "*", "*"],
      ['▲', '▲', "*", "*", "*", "*", "*", "*", "*", "*"],
      ['▲', "*", "*", "*", "*", "*", "*", "*", "*", "*"],
      ['▲', "*", "*", "*", "*", "*", "*", "*", "*", "*"],
      ['▲', "*", "*", "*", "*", "*", "*", "*", "*", "*"]]
b2 = [['*', '*', '*', '*', '*', '*', '*', '*', '*', '*'],
      ['*', '*', '*', '*', '*', '*', '*', '*', '*', '*'],
      ['*', '*', '*', '*', '*', '*', '*', '*', '*', '*'],
      ['*', '*', '*', '*', '*', '*', '*', '*', '*', '*'],
      ['*', '*', '*', '*', '*', '*', '*', '*', '*', '*'],
      ['*', '*', '*', '*', '*', '*', '*', '*', '*', '*'],
      ['*', '*', '*', '*', '*', '*', '*', '*', '*', '*'],
      ['*', '*', '*', '*', '*', '*', '*', '*', '*', '*'],
      ['*', '*', '*', '*', '*', '*', '*', '*', '*', '*'],
      ['▲', '▲', '▲', '▲', '▲', '▲', '▲', '▲', '*', '*']]
b3 = [["*", "*", "*", "*", "*", '*', '*', '▲', '▲', '▲'],
      ["*", "*", "*", "*", "*", '*', '▲', '▲', '▲', "▲"],
      ["*", "*", "*", "*", "*", '*', '*', "*", '▲', '▲'],
      ["*", "*", "*", "*", '▲', '▲', '▲', '*', '*', '*'],
      ["*", "*", "*", '▲', '▲', '▲', '▲', "*", '*', '*'],
      ["*", "*", '▲', '▲', '▲', '▲', '▲', '▲', '*', '*'],
      ["*", "*", "*", '▲', '▲', '▲', '▲', '*', '*', '*'],
      ["*", "*", "*", '▲', '▲', '▲', '▲', "*", '*', "*"],
      ["*", "*", "*", '*', '*', '▲', '▲', '▲', '▲', "▲"],
      ["*", "*", "*", '*', '*', '*', '▲', '▲', '▲', "▲"]]
c1 = [["▲", "*", "*", "*", "*", "*", "*", "*", "*", "▲"],
      ["▲", "▲", "▲", "▲", "*", "*", "*", "*", "*", "▲"],
      ["▲", "▲", "▲", "*", "*", "*", "*", "*", "*", "▲"],
      ["▲", "▲", "*", "*", "*", "*", "*", "*", "*", "▲"],
      ["▲", "▲", "*", "*", "*", "*", "*", "*", "*", "▲"],
      ["▲", "▲", "▲", "*", "*", "*", "*", "*", "*", "▲"],
      ["▲", "▲", "▲", "*", "*", "*", "*", "*", "*", "▲"],
      ["▲", "▲", "*", "*", "*", "*", "*", "*", "▲", "▲"],
      ["▲", "▲", "spawn", "*", "*", "*", "*", "▲", "▲", "▲"],
      ["▲", "▲", "▲", "▲", "▲", "▲", "▲", "▲", "▲", "▲"]]
c2 = [['▲', '▲', '▲', '▲', '▲', '▲', '▲', '▲', '*', '*'],
      ['▲', '*', '*', '*', '*', '*', '*', '*', '*', '*'],
      ['▲', '*', '*', '*', '*', '*', '*', '*', '*', '*'],
      ['▲', '*', '*', '*', '*', '*', '*', '*', '*', '*'],
      ['▲', '*', '*', '*', '*', '*', '*', '*', '*', '*'],
      ['▲', '*', '*', '*', '*', '*', '*', '*', '*', '*'],
      ['▲', '▲', '*', '*', '*', '*', '*', '*', '*', '*'],
      ['▲', '▲', '*', '*', '*', '*', '▲', '▲', '*', '*'],
      ['▲', '▲', '▲', '*', '*', '*', '▲', '▲', "▲", '▲'],
      ["▲", "▲", "▲", "▲", "▲", "▲", "▲", "▲", "▲", "▲"]]
c3 = [["*", "*", "*", "*", "*", '*', '*', '*', '*', "*"],
      ["*", "*", "*", "*", "*", '▲', '▲', '▲', '▲', '▲'],
      ["*", "*", "*", "*", "*", '▲', '▲', '▲', '▲', "▲"],
      ["*", "*", "*", "*", "*", '*', '▲', '▲', '▲', "▲"],
      ["*", "*", "*", "*", "*", '*', '▲', '▲', '▲', "▲"],
      ["*", "*", "*", "*", "*", '*', '*', '▲', '▲', "▲"],
      ["*", "*", "*", "*", "*", '*', '*', '▲', '▲', "▲"],
      ["*", "*", "*", "*", "*", '*', '*', '*', '*', "*"],
      ["*", "*", "*", "*", "*", '*', '*', '▲', '▲', "▲"],
      ["▲", "▲", "▲", "▲", "▲", "▲", "▲", "▲", "▲", "▲"]]
c = 0
map = [[a1, a2, a3],
       [b1, b2, b3],
       [c1, c2, c3]]
player_HP = 100
print("напиши свое имя друг")
player_name = input()
if player_name == "killroyka2241":
    potions = 999
    player_HP = 99999
max_enemy_DMG = 0


def fight(level, player_name):
    global potions, max_enemy_DMG, enemy_HP, player_HP
    enemies = ["big raven", "ork", "golum", "geografi teacher", "dragon", "big raven", "ork", "golum",
               "geografi teacher"]
    enemy = random.choice(enemies)
    if level == 3 and enemy != "dragon":
        enemy_HP = 300
        max_enemy_DMG = 50
    elif level == 2 and enemy != "dragon":
        enemy_HP = 200
        max_enemy_DMG = 35
    elif level == 1 and enemy != "dragon":
        enemy_HP = 100
        max_enemy_DMG = 20
    elif level == "dragon" or enemy == "dragon":
        enemy_HP = 1000
        max_enemy_DMG = 100
        enemy = "dragon"

    print("на вас напал: " + enemy)
    sl(1)
    print("здоровье врага:", enemy_HP)
    print("Ваше здоровье:", player_HP)
    sl(1)
    if enemy == "dragon":
        print("тоби пиздец")
    print("Завязался бой!!!")
    sl(1)
    while enemy_HP >= 0 or player_HP >= 0:
        print("==============")
        print("[1]NORMAL ATACK(0 - 30DMG)")
        print("[2]MAGICK ATACK(-10 - 50dmg)")
        print("[3]DRINK POTION(+ 20 - 40 HP)")
        print("[4]STAN(enemies dmg -10)")
        player_move = input()
        sl(1)
        if player_move == "1":
            DMG = random.randrange(0, 30, 5)
            if DMG == 0:
                print("Промах?!")
            else:
                enemy_HP -= DMG
            print("ваш урон : ", DMG)
        elif player_move == "2":
            DMG = random.randrange(-10, 50, 5)
            if DMG < 0:
                player_HP += DMG
            elif DMG == 0:
                print("магия отстой, ты промазал")
            else:
                enemy_HP -= DMG
            print("ваш урон : ", DMG)
        elif player_move == "3":
            HP = random.randrange(20, 40, 5)
            if potions != 0:
                player_HP += HP
                print("вы вылечили", HP, "здоровья")
                print("you have", potions, "potions")
                potions -= 1
                sl(1)
            else:
                print("Noob, you dont have potions")
        elif player_move == "4":
            print("урон противника понизился на 10!")
            if max_enemy_DMG >= 10:
                max_enemy_DMG -= 10
        elif player_move == "kill":
            player_HP = 0

        elif player_move == "2241":
            enemy_HP = 0
            player_HP = 100
        else:
            print("выбери отаку, не майся херней")
        enemy_DMG = random.randrange(0, max_enemy_DMG, 5)

        if enemy_DMG == 0:
            print("ты везунчик: ", enemy, " промазал!")
        else:
            player_HP -= enemy_DMG
        if enemy_HP <= 0 or player_HP <= 0:
            break

        print("урон врага: ", enemy_DMG)
        print("==============")
        sl(1)
        print("здоровье врага:", enemy_HP)
        print("Ваше здоровье:", player_HP)
        sl(1)
    sl(1)
    print("==============")
    if player_HP == 0:
        print(player_name, "проиграл!!!")
        print("ну ты и лох. Выбери сложность помешьше")
    elif enemy_HP == 0 and enemy == "dragon":
        print("поклонитесь", player_name, "что освободиил наши земли от дракона")
        print("отныне ты наш альтаир")
        sl(1.5)
    else:
        print("ты победил")
        print("мои поздравления", player_name)
        sl(1)
        drop = random.choice(potion_drop_chanse)
        potions += drop
        print("it is drop", drop, "potions")
        sl(1)


def walk():
    level = 3
    mob = [0, 0, 0, 0, 0, 0, 1]
    coords = [[2, 0], [-2, 2]]
    while coords != [[2, 2], [-3, 8]]:
        for y in map[coords[0][0]][coords[0][1]]:
            for x in y:
                print(x, end="\t")
            print()
        print(map[coords[0][0]][coords[0][1]][coords[1][0]][coords[1][1]])
        print("выбери куда тебе идти")
        print("[W]вверх")
        print("[S]вниз")
        print("[A]влево")
        print("[D]вправо")
        print("[p]выведит кол-во зелей")
        choise = input()
        map[coords[0][0]][coords[0][1]][coords[1][0]][coords[1][1]] = "*"
        if choise == "w" and map[coords[0][0]][coords[0][1]][coords[1][0] - 1][coords[1][1]] == "*":
            coords[1][0] -= 1
        elif choise == "s" and map[coords[0][0]][coords[0][1]][coords[1][0] + 1][coords[1][1]] == "*":
            coords[1][0] += 1
        elif choise == "a" and map[coords[0][0]][coords[0][1]][coords[1][0]][coords[1][1] - 1] == "*":
            coords[1][1] -= 1
        elif choise == "d" and map[coords[0][0]][coords[0][1]][coords[1][0]][coords[1][1] + 1] == "*":
            coords[1][1] += 1
        elif choise == "p":
            print("you have", potions, "potions")
            sl(1)
        elif choise == "wwssadad":
            coords = [[2, 2], [-3, 7]]
        elif choise != "w" or "s" or "a" or "d":
            print("W A S D or p что ту не понятного?!!")
            sl(1)
        else:
            print("чел, ты не горный козел")
            sl(1)
        map[coords[0][0]][coords[0][1]][coords[1][0]][coords[1][1]] = 0
        print(coords)
        if coords[1][0] <= - 10:
            coords[0][0] -= 1
            coords[1][0] = -1
        elif coords[1][0] >= 0:
            coords[0][0] += 1
            coords[1][0] = - 10
        elif coords[1][1] >= 9:
            coords[0][1] += 1
            coords[1][1] = 0
        elif coords[1][1] <= 0:
            coords[0][1] -= 1
            coords[1][1] = 9
        if random.choice(mob) == 1:
            if coords[0] == [2, 0] or coords[0] == [1, 0] or coords[0] == [0, 0]:
                level = 1
            elif coords[0] == [2, 1] or coords[0] == [1, 1] or coords[0] == [0, 1]:
                level = 2
            fight(level, player_name)
        if coords == [[2, 2], [-3, 7]]:
            fight("dragon", player_name)

    print("you won!!!!!")


walk()
